odin-rails/flight-booker/app/views/bookings/show.html.erb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = ?  [["booking_id", 1]]
---
	<legend>Passenger information</legend>
<% @booking.passengers.each do |passenger| %>