odin-rails/flight-booker/app/controllers/bookings_controller.rb

	def new
		@booking = Booking.new
		@flight = Flight.find(params[:flight_id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT 1  [["id", 75]]

	def create
		@booking = Booking.new(booking_params)
		if @booking.save
			@booking.passengers.each do |passenger|
---
INSERT INTO "bookings" ("flight_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["flight_id", 44], ["created_at", "2015-05-23 20:38:22.117959"], ["updated_at", "2015-05-23 20:38:22.117959"]]
SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = ?  [["booking_id", 5]]

	def show
		@booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", 1]]