odin-rails/flight-booker/app/controllers/flights_controller.rb

	def index
		@to_airports = Airport.all.map{ |x| [x.location, x.code] }
		@from_airports = Airport.all.map{ |x| [x.location, x.code] }
		@dates = Flight.start_dates
		@passengers = [*1..4].map{|x| [x, x.to_s]}

		if params[:search]
			@to = params[:to_code]
			@from = params[:from_code]
			@date = Flight.date_from_dmy(params[:date])
			@flights = Flight.search(params)
---
SELECT  "airports".* FROM "airports" WHERE "airports"."code" = ? LIMIT 1  [["code", "NYC"]]
SELECT "flights".* FROM "flights"